In [1]:
import pandas as pd

In [4]:
df = pd.read_excel('data/2016-01.xls', index_col='상품명')
print(df.shape)
df.head()

(200, 3)

       판매건수     가격        매출
상품명
봉투    12362     50    618100
바나나    4285   3900  16711500
야채     4190      0         0
켐벨포도   2780  29800  82844000
알뜰특란   2768   5300  14670400

In [5]:
df.head?

Signature: df.head(n: int = 5) -> ~FrameOrSeries
Docstring:
Return the first `n` rows.

This function returns the first `n` rows for the object based
on position. It is useful for quickly testing if your object
has the right type of data in it.

For negative values of `n`, this function returns all rows except
the last `n` rows, equivalent to ``df[:-n]``.

Parameters
----------
n : int, default 5
    Number of rows to select.

Returns
-------
same type as caller
    The first `n` rows of the caller object.

See Also
--------
DataFrame.tail: Returns the last `n` rows.

Examples
--------
>>> df = pd.DataFrame({'animal': ['alligator', 'bee', 'falcon', 'lion',
...                    'monkey', 'parrot', 'shark', 'whale', 'zebra']})
>>> df
      animal
0  alligator
1        bee
2     falcon
3       lion
4     monkey
5     parrot
6      shark
7      whale
8      zebra

Viewing the first 5 lines

>>> df.head()
      animal
0  alligator
1        bee
2     falcon
3       lion
4     monkey

Viewing the first `n` lines (three in this case)

>>> df.head(3)
      animal
0  alligator
1        bee
2     falcon

For negative values of `n`

>>> df.head(-3)
      animal
0  alligator
1        bee
2     falcon
3       lion
4     monkey
5     parrot
File:      d:\work\dev\anaconda3\lib\site-packages\pandas\core\generic.py
Type:      method

In [6]:
df.head(10)

        판매건수     가격        매출
상품명
봉투     12362     50    618100
바나나     4285   3900  16711500
야채      4190      0         0
켐벨포도    2780  29800  82844000
알뜰특란    2768   5300  14670400
딸기      2234      0         0
팔음산포도   2161  19800  42787800
봉투      2038     30     61140
애호박     1962   1490   2923380
청양고추    1901      0         0

In [7]:
df.tail()

                   판매건수    가격       매출
상품명
바지락                 253     0        0
해표)카놀라유             253  5600  1416800
오)자른당면              252  5850  1474200
롯데)알뜰소시지            252  4400  1108800
한돈앞다리/불고기,찌개(국내산)   252     0        0

In [8]:
df.nlargest(10, '판매건수')

        판매건수     가격        매출
상품명
봉투     12362     50    618100
바나나     4285   3900  16711500
야채      4190      0         0
켐벨포도    2780  29800  82844000
알뜰특란    2768   5300  14670400
딸기      2234      0         0
팔음산포도   2161  19800  42787800
봉투      2038     30     61140
애호박     1962   1490   2923380
청양고추    1901      0         0

In [9]:
df.nsmallest(10, '판매건수')

                   판매건수    가격       매출
상품명
오)자른당면              252  5850  1474200
롯데)알뜰소시지            252  4400  1108800
한돈앞다리/불고기,찌개(국내산)   252     0        0
CJ)행콩나물             253  1950   493350
바지락                 253     0        0
해표)카놀라유             253  5600  1416800
온동네광천파래재래김(전장)      255  2550   650250
새송이버섯               255     0        0
CJ)주부초밥왕(소풍)        256  3750   960000
황도복숭아               258     0        0

In [10]:
df.nsmallest(10, ['판매건수', '가격'])

                   판매건수    가격       매출
상품명
한돈앞다리/불고기,찌개(국내산)   252     0        0
롯데)알뜰소시지            252  4400  1108800
오)자른당면              252  5850  1474200
바지락                 253     0        0
CJ)행콩나물             253  1950   493350
해표)카놀라유             253  5600  1416800
새송이버섯               255     0        0
온동네광천파래재래김(전장)      255  2550   650250
CJ)주부초밥왕(소풍)        256  3750   960000
황도복숭아               258     0        0

In [11]:
df.sort_values?

Signature:
df.sort_values(
    by,
    axis=0,
    ascending=True,
    inplace=False,
    kind='quicksort',
    na_position='last',
    ignore_index=False,
)
Docstring:
Sort by the values along either axis.

Parameters
----------
        by : str or list of str
            Name or list of names to sort by.

            - if `axis` is 0 or `'index'` then `by` may contain index
              levels and/or column labels.
            - if `axis` is 1 or `'columns'` then `by` may contain column
              levels and/or index labels.

            .. versionchanged:: 0.23.0

               Allow specifying index or column level names.
axis : {0 or 'index', 1 or 'columns'}, default 0
     Axis to be sorted.
ascending : bool or list of bool, default True
     Sort ascending vs. descending. Specify list for multiple sort
     orders.  If this is a list of bools, must match the length of
     the by.
inplace : bool, default False
     If True, perform operation in-place.
kind : {'quicksort', 'mergesort', 'heapsort'}, default 'quicksort'
     Choice of sorting algorithm. See also ndarray.np.sort for more
     information.  `mergesort` is the only stable algorithm. For
     DataFrames, this option is only applied when sorting on a single
     column or label.
na_position : {'first', 'last'}, default 'last'
     Puts NaNs at the beginning if `first`; `last` puts NaNs at the
     end.
ignore_index : bool, default False
     If True, the resulting axis will be labeled 0, 1, …, n - 1.

     .. versionadded:: 1.0.0

Returns
-------
sorted_obj : DataFrame or None
    DataFrame with sorted values if inplace=False, None otherwise.

Examples
--------
>>> df = pd.DataFrame({
...     'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
...     'col2': [2, 1, 9, 8, 7, 4],
...     'col3': [0, 1, 9, 4, 2, 3],
... })
>>> df
    col1 col2 col3
0   A    2    0
1   A    1    1
2   B    9    9
3   NaN  8    4
4   D    7    2
5   C    4    3

Sort by col1

>>> df.sort_values(by=['col1'])
    col1 col2 col3
0   A    2    0
1   A    1    1
2   B    9    9
5   C    4    3
4   D    7    2
3   NaN  8    4

Sort by multiple columns

>>> df.sort_values(by=['col1', 'col2'])
    col1 col2 col3
1   A    1    1
0   A    2    0
2   B    9    9
5   C    4    3
4   D    7    2
3   NaN  8    4

Sort Descending

>>> df.sort_values(by='col1', ascending=False)
    col1 col2 col3
4   D    7    2
5   C    4    3
2   B    9    9
0   A    2    0
1   A    1    1
3   NaN  8    4

Putting NAs first

>>> df.sort_values(by='col1', ascending=False, na_position='first')
    col1 col2 col3
3   NaN  8    4
4   D    7    2
5   C    4    3
2   B    9    9
0   A    2    0
1   A    1    1
File:      d:\work\dev\anaconda3\lib\site-packages\pandas\core\frame.py
Type:      method

In [16]:
df.sort_values('가격', ascending=False)[:100]

              판매건수     가격        매출
상품명
켐벨포도          2780  29800  82844000
감귤             297  29800   8850600
동서)맥심모카골드믹스    380  23800   9044000
팔음산포도         2161  19800  42787800
부사             844   9800   8271200
...            ...    ...       ...
풀)액티비아컵(플레인)   488   2350   1146800
롯데)제주감귤        632   2350   1485200
해)킨사이다         302   2250    679500
크린백(중）25*35    378   2250    850500
동원)마일드참치       576   2250   1296000

[100 rows x 3 columns]

In [17]:
df.columns

Index(['판매건수', '가격', '매출'], dtype='object')

In [18]:
df['판매건수']

상품명
봉투                   12362
바나나                   4285
야채                    4190
켐벨포도                  2780
알뜰특란                  2768
                     ...
바지락                    253
해표)카놀라유                253
오)자른당면                 252
롯데)알뜰소시지               252
한돈앞다리/불고기,찌개(국내산)      252
Name: 판매건수, Length: 200, dtype: int64

In [20]:
names = ['판매건수']
df[names]

                    판매건수
상품명
봉투                 12362
바나나                 4285
야채                  4190
켐벨포도                2780
알뜰특란                2768
...                  ...
바지락                  253
해표)카놀라유              253
오)자른당면               252
롯데)알뜰소시지             252
한돈앞다리/불고기,찌개(국내산)    252

[200 rows x 1 columns]

In [21]:
df.sort_values('가격', ascending=False)[['가격']][:100]

                 가격
상품명
켐벨포도          29800
감귤            29800
동서)맥심모카골드믹스   23800
팔음산포도         19800
부사             9800
...             ...
풀)액티비아컵(플레인)   2350
롯데)제주감귤        2350
해)킨사이다         2250
크린백(중）25*35    2250
동원)마일드참치       2250

[100 rows x 1 columns]

In [26]:
names = ['야채', '딸기', '봉투']
df.loc[names].sort_values('판매건수', ascending=False)

      판매건수  가격      매출
상품명
봉투   12362  50  618100
야채    4190   0       0
딸기    2234   0       0
봉투    2038  30   61140

In [27]:
df.iloc[:10]

        판매건수     가격        매출
상품명
봉투     12362     50    618100
바나나     4285   3900  16711500
야채      4190      0         0
켐벨포도    2780  29800  82844000
알뜰특란    2768   5300  14670400
딸기      2234      0         0
팔음산포도   2161  19800  42787800
봉투      2038     30     61140
애호박     1962   1490   2923380
청양고추    1901      0         0

In [28]:
df.head(10)

        판매건수     가격        매출
상품명
봉투     12362     50    618100
바나나     4285   3900  16711500
야채      4190      0         0
켐벨포도    2780  29800  82844000
알뜰특란    2768   5300  14670400
딸기      2234      0         0
팔음산포도   2161  19800  42787800
봉투      2038     30     61140
애호박     1962   1490   2923380
청양고추    1901      0         0

In [29]:
df.loc['야채':'딸기']

      판매건수     가격        매출
상품명
야채    4190      0         0
켐벨포도  2780  29800  82844000
알뜰특란  2768   5300  14670400
딸기    2234      0         0

In [30]:
df.loc['야채':'딸기', '매출']

상품명
야채             0
켐벨포도    82844000
알뜰특란    14670400
딸기             0
Name: 매출, dtype: int64

In [32]:
df.loc['야채':'딸기', ['매출', '가격']]

            매출     가격
상품명
야채           0      0
켐벨포도  82844000  29800
알뜰특란  14670400   5300
딸기           0      0

In [35]:
mask = df['가격'] > 20000
df[mask]

             판매건수     가격        매출
상품명
켐벨포도         2780  29800  82844000
동서)맥심모카골드믹스   380  23800   9044000
감귤            297  29800   8850600

In [36]:
mask = (df['가격'] > 5000) & (df['가격']  <=20000)
df[mask]

             판매건수     가격        매출
상품명
알뜰특란         2768   5300  14670400
팔음산포도        2161  19800  42787800
거봉           1013   6900   6989700
대추방울          936   7500   7020000
부사            844   9800   8271200
봉지사과          690   7900   5451000
삼부자)광천도시락김    686   5400   3704400
부추            602   5500   3311000
삼양)갓짬뽕        564   5400   3045600
백설)진한참기름      435   5980   2601300
켈로그)콘푸로스트     398   7200   2865600
목우촌)교자만두      372   8150   3031800
목우촌)뚝심        358   5980   2140840
백설)맛밤패밀리팩     324   7950   2575800
오)진짬뽕         319   5600   1786400
롯)엔네이처프랑크     300   6950   2085000
백설)알짜란        298   5100   1519800
삼양)갓짜장        287   5400   1549800
해표)식용유        284   5650   1604600
삼립)호빵(단팥야채)   260   5500   1430000
해표)카놀라유       253   5600   1416800
오)자른당면        252   5850   1474200